Revit 2027 API
FilteredElementCollector.OfCategory Method
 Applies an ElementCategoryFilter to the collector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilteredElementCollector OfCategory(
	BuiltInCategory category
)
Public Function OfCategory (
	category As BuiltInCategory
) As FilteredElementCollector
public:
FilteredElementCollector^ OfCategory(
	BuiltInCategory category
)
member OfCategory :
        category : BuiltInCategory -> FilteredElementCollector
Parameters
category BuiltInCategory
 The category.
Return Value
FilteredElementCollector
 This collector.
Remarks
 Only elements of this category id will pass the collector.
Example
// Use OfCategory method to apply an ElementCategoryFilter and fine elements in the Doors category
FilteredElementCollector collector = new FilteredElementCollector(document);
ICollection<Element> doors = collector.OfCategory(BuiltInCategory.OST_Doors).ToElements();
See Also
Reference
FilteredElementCollector Class
Autodesk.Revit.DB Namespace